"""Блок советов для начала работы на экране чата."""

from textual.widgets import Static


class Recommend(Static):
    """Виджет с советами для начала работы."""

    def render(self) -> str:
        """Отрисовка советов.

        Returns:
            str: Текст советов для пользователя
        """
        recommend  = '''
  Советы для начала работы:
  1. Задавайте вопросы, редактируйте файлы или запускайте команды
  2. Будьте конкретны для получения наилучших результатов
  3. /help для получения дополнительной информации

        '''

        return recommend
